; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	Star3 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Star0 - direction
	Star4 - direction
	GroundStation7 - direction
	GroundStation6 - direction
	Star1 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation7)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet18)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation7)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument6 thermograph0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star0)
	(supports instrument7 spectrograph1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation7)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star1)
	(calibration_target instrument8 GroundStation6)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation5)
)
(:goal (and
	(pointing satellite1 Phenomenon14)
	(pointing satellite2 Star0)
	(have_image Phenomenon8 spectrograph1)
	(have_image Planet9 thermograph0)
	(have_image Star10 thermograph0)
	(have_image Star11 thermograph0)
	(have_image Star12 thermograph0)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon14 thermograph0)
	(have_image Planet15 thermograph0)
	(have_image Planet16 spectrograph1)
	(have_image Star17 spectrograph1)
	(have_image Planet18 thermograph0)
))

)

; plan
1. (turn_to satellite1 phenomenon14 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 13
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 13
3. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 1 of 13
4. (turn_to satellite0 planet16 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet16)
   goals met: 1 of 13
5. (take_image satellite0 planet16 instrument1 spectrograph1)
   added: (have_image planet16 spectrograph1)
   goals met: 2 of 13
6. (turn_to satellite0 planet15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet15)
   goals met: 2 of 13
7. (take_image satellite0 planet15 instrument1 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 3 of 13
8. (turn_to satellite0 phenomenon8 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 13
9. (take_image satellite0 phenomenon8 instrument1 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 4 of 13
10. (turn_to satellite0 phenomenon14 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 13
11. (take_image satellite0 phenomenon14 instrument1 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 5 of 13
12. (turn_to satellite0 phenomenon13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 13
13. (take_image satellite0 phenomenon13 instrument1 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 6 of 13
14. (turn_to satellite0 planet18 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet18)
   goals met: 6 of 13
15. (take_image satellite0 planet18 instrument1 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 7 of 13
16. (turn_to satellite0 planet9 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet9)
   goals met: 7 of 13
17. (take_image satellite0 planet9 instrument1 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 8 of 13
18. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 8 of 13
19. (take_image satellite0 star10 instrument1 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 9 of 13
20. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 9 of 13
21. (take_image satellite0 star11 instrument1 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 10 of 13
22. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 10 of 13
23. (take_image satellite0 star12 instrument1 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 11 of 13
24. (turn_to satellite0 star17 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star17)
   goals met: 11 of 13
25. (take_image satellite0 star17 instrument1 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 12 of 13
26. (turn_to satellite2 star0 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star0)
   goals met: 13 of 13
